Revit 2026 API

# LightFamilySetLightDistributionStyle Method

---

Set the light distribution style to the given shape distribution

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetLightDistributionStyle(
	LightDistributionStyle lightDistributionStyle
)
```
```vb
Public Sub SetLightDistributionStyle (
	lightDistributionStyle As LightDistributionStyle
)
```
```cpp
public:
void SetLightDistributionStyle(
	LightDistributionStyle lightDistributionStyle
)
```
```fsharp
member SetLightDistributionStyle :
        lightDistributionStyle : LightDistributionStyle -> unit
```

#### Parameters

lightDistributionStyle LightDistributionStyle
     The light distribution style to set the light distribution type to

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

#### Reference

LightFamily Class

Autodesk.Revit.DB.Lighting Namespace